<template>
	<view>
		<view class="all">
			<!-- 大标题部分 -->
			<view class="big_title">
				家庭保护专项
			</view>
			
			<view style="margin-bottom: 40rpx;">
				<b>
					父母是孩子的第一任老师，是抚养、教育、保护未成年人的第一责任人。监护既是权利，也是义务，父母或其他监护人应当履行监护职责，不得侵犯孩子的合法权益。				</b>
			</view>
			
			<view class="main_part2" v-for="item in items_part2">
				<view class="small_title">{{item.small_title}}</view>
				<view class="small_title_describe">
					{{item.p}}<b>{{item.p_bolder}}</b>
				</view>
				<view class="describe" v-for="it in item.describe">{{it.des}}{{it.des2}} <b>{{it.pp_bolder}}</b></view>
				
			</view>
			<view class="footer">
				<button class="footer_button" @click="getNext">发起举报</button>
			</view>
			
		</view>

	</view>
</template>

<script>
	export default {
	    // props: ['actionSheetList', 'title'],
	    // components: {
	    //     textCounter
	    // },
	    data() {
	        return {
				items_part2:[{
					"small_title":"监护侵害、监护不当：",
					"p":"根据《未成年人保护法》规定，未成年人的父母或者其他监护人",
					"p_bolder":"不得实施下列行为：",
					"describe":[
						{"des":"（一）虐待、遗弃、非法送养未成年人或者对未成年人实施家庭暴力；"},
						{"des":"（二）放任、教唆或者利用未成年人实施违法犯罪行为；"},
						{"des":"（三）放任、唆使未成年人参与邪教、迷信活动或者接受恐怖主义、分裂主义、极端主义等侵害；"},
						{"des":"（四）放任、唆使未成年人吸烟（含电子烟，下同）、饮酒、赌博、流浪乞讨或者欺凌他人；"},
						{"des":"（五）放任或者迫使应当接受义务教育的未成年人失学、辍学；"},
						{"des":"（六）放任未成年人沉迷网络，接触危害或者可能影响其身心健康的图书、报刊、电影、广播电视节目、音像制品、电子出版物和网络信息等；"},
						{"des":"（七）放任未成年人进入营业性娱乐场所、酒吧、互联网上网服务营业场所等不适宜未成年人活动的场所；"},
						{"des":"（八）允许或者迫使未成年人从事国家规定以外的劳动；"},
						{"des":"（九）允许、迫使未成年人结婚或者为未成年人订立婚约；"},
						{"des":"（十）违法处分、侵吞未成年人的财产或者利用未成年人牟取不正当利益；"},
						{"des":"（十一）其他侵犯未成年人身心健康、财产权益或者不依法履行未成年人保护义务的行为。"},
					]
				},{
					
					"p":"《未成年人保护法》还列明了父母或者其他监护人",
					"p_bolder":"应当履行的监护职责：",
					"describe":[
						{"des":"（一）为未成年人提供生活、健康、安全等方面的保障；"},
						{"des":"（二）关注未成年人的生理、心理状况和情感需求；"},
						{"des":"（三）教育和引导未成年人遵纪守法、勤俭节约，养成良好的思想品德和行为习惯；"},
						{"des":"（四）对未成年人进行安全教育，提高未成年人的自我保护意识和能力；"},
						{"des":"（五）尊重未成年人受教育的权利，保障适龄未成年人依法接受并完成义务教育；"},
						{"des":"（六）保障未成年人休息、娱乐和体育锻炼的时间，引导未成年人进行有益身心健康的活动；"},
						{"des":"（七）妥善管理和保护未成年人的财产；"},
						{"des":"（八）依法代理未成年人实施民事法律行为；"},
						{"des":"（九）预防和制止未成年人的不良行为和违法犯罪行为，并进行合理管教；"},
						{"des":"（十）其他应当履行的监护职责。"},
						{"des":"发现父母或其他监护人存在监护侵害、监护不当情形，不依法履行监护职责或者侵犯未成年人合法权益的，可提供线索，进行举报。"},
					]
				},{
					"small_title":"监护缺失：",
					"p":"未成年人的父母或者其他监护人应当使未成年人获得有效监护，不得使孩子陷入监护缺失状态。监护缺失，是指未成你人没有有效的监护人，或虽有监护人但监护人没有完全履行其监护责任。具体表现形式：",
					"describe":[
						{"des":"（1）隔代监护型"},
						{"des2":"这种监护多见于父母双亡或父母双双外出打工的家庭，未成年人完全由祖父母或外祖父母监护，但祖辈往往年迈体弱，教育水平低，只能为未成年人提供一定的物质保障，在精神、道德、教育等方面则缺乏管束和引导，无法全方位地监护未成年人，导致未成年人处于事实上的监护缺失状态。"},
						{"des":"（2）代为监护型"},
						{"des2":"即由未成年人父母的亲戚或朋友进行监护，一般是父母外出将未成年人暂时或长期托付给同辈人照管，但此种情形下的临时监护人对未成年人的关心往往只体现在物质保障上，对其习惯的培养以及合法权益的保障等方面则很少关注，导致未成年人缺乏监管、放任自流，不但自身合法权益容易受到侵害，也容易结交不良朋友侵害他人权益。"},
						{"des":"（3）单亲监护型"},
						{"des2":"指父母离异后，未成年人跟其中一方生活，监护人将小孩子送到寄宿学校，或因忙于谋生，无暇亲自照顾小孩，无法全方位地监护孩子，致使未成年人实际处于监护缺失的状态。"},
						{"des":"（4）自我监护型"},
						{"des2":"即完全的监护缺失状态，此种监护多见于外来务工的未成年人以及城市流浪儿童等。独自务工的未成年人几乎脱离了父母的监护管束，加上心智尚未成熟，文化程度较低，遇到合法权益遭受侵害时不知如何应对。而城市流浪儿童生存状态更加恶劣，身心发展与权利实现状况令人堪忧。这些完全自我监护的未成年人由于年龄小、缺乏生存技能，在合法权益得不到保障的情形下，极容易受不良风气熏陶而违法犯罪。"},
						{"des":"发现身边存在监护缺失的未成年人，可积极提供线索、进行报告。"}
					]
				},{
					"small_title":"困境、留守儿童救助：",
					"describe":[
						{"des":"困境儿童："},
						{"des2":"困境儿童包括因家庭贫困导致生活、就医、就学等困难的儿童，因自身残疾导致康复、照料、护理和社会融入等困难的儿童，以及因家庭监护缺失或监护不当遭受虐待、遗弃、意外伤害、不法侵害等导致人身安全受到威胁或侵害的儿童。【国务院关于加强困境儿童保障工作的意见 （国发〔2016〕36号）】"},
						{"des":"留守儿童："},
						{"des2":"留守儿童是指外出务工连续三个月以上的农民托留在户籍所在地家乡，由父、母单方或其他亲属监护接受义务教育的适龄儿童少年。【国务院关于加强农村留守儿童关爱保护工作的意见】"},
						{"des":"发现身边存在困境、留守儿童需要救助的，可积极提供线索、进行报告。"},
						{"pp_bolder":"人民检察院、接收举报线索的工作人员对报案人的信息予以保密。"}
						],
					
				}]
			}
		},
		methods:{
			getNext(){
				uni.navigateTo({
					url:'./index3'
				})
			}
		}
	}
</script>

<style lang="scss" scoped>
	.all {
		margin: 20rpx;
		padding: 10rpx;
		font-size: 32rpx;
		letter-spacing: 2rpx;
		font-weight: 500;
		padding-bottom: 100rpx;
		.big_title {
			font-weight: bolder;
			font-size: 48rpx;
			margin-bottom: 60rpx;
		}
		
		
		.main_part2{
			margin-bottom: 40rpx;
			
			.small_title{
				font-weight: bolder;
				font-size: 36rpx;
				margin-bottom: 20rpx;
			}
			
			.small_title_describe{

				
			}
			.describe{
				line-height: 44rpx;
				
			}
		}
		
		.footer{
			width: 102%;
			background-color: #FFFFFF;
			height: 110rpx;
			position: fixed;
			bottom: -1px;
			margin-top: 30rpx;
			margin-left: -36rpx;
			padding-top: 16rpx;
			.footer_button {
				background-color: #408ce2;
				color: #FFFFFF;
				letter-spacing: 4rpx;
				font-size: 32rpx;
				width: 95%;
				
			}
		}
	
		
	}
</style>
